# Задача 6: Вы пользуетесь общественным транспортом? Вероятно, вы 
# расплачивались за проезд и получали билет с номером. Счастливым 
# билетом называют такой билет с шестизначным номером, где сумма 
# первых трех цифр равна сумме последних трех. Т.е. билет с номером 
# 385916 – счастливый, т.к. 3+8+5=9+1+6. Вам требуется написать 
# программу, которая проверяет счастливость билета.
# 385916 -> yes
# 123456 -> no

x=input('Введите шестизначное число: ')
if len(x)==6:
    sum1=int(x[0])+int(x[1])+int(x[2])
    sum2=int(x[3])+int(x[4])+int(x[5])
    if sum1==sum2:
        print('Yes')  
    else:
        print('Несчастливый билет') 
else:
    print('No') 

